read_verilog -sv digital/RNG.v
read_verilog -sv digital/UMull.v
read_verilog -sv digital/KaratMul.v
read_verilog -sv digital/ShaddMul.v
read_verilog -sv digital/Bench.v


read_verilog -lib yosys/prim_cells.v

proc;; memory;; techmap;;

dfflibmap -liberty yosys/prim_cells.lib
abc -liberty yosys/prim_cells.lib;;

# write_verilog sender_lwc.v
write_spice bench.mod
